capitals={"Россия":"Москва","США":"Вашингтон","Мексика":"Мехико","Великобритания":"Лондон","Казахстан":"Астана","Япония":"Токио"}
"""Создадим словарь с странами и их столицами"""
for key, value in capitals.items():
     print(key+"="+str(value))
"""Выводим с помощью цикла страну и её столицу"""
a=(input('Выберите страну из списка, чтобы заменить её столицу ')).capitalize()
"""Попросим пользователя ввести страну"""
b=(input('Введите столицу введённой страны ')).capitalize()
"""Попросим пользователя ввести столицу"""
capitals[a] =b   
"""Добавляем новую пару в существующий список"""
for key, value in capitals.items():
     print(key+"="+str(value))
"""Выводим с помощью цикла страну и её столицу"""