capitals={"Россия":"Москва","США":"Вашингтон","Мексика":"Мехико","Великобритания":"Лондон","Казахстан":"Астана","Япония":"Токио"}
"""Создадим словарь с странами и их столицами"""
for key, value in capitals.items():
     print(key+"="+str(value))
"""Выводим с помощью цикла страну и её столицу"""
a=(input('Выберите страну из списка, чтобы убрать её из списка ')).capitalize()
"""Попросим пользователя ввести страну"""
del capitals[a] 
"""Удаляем из списка выбранную пару """
for key, value in capitals.items():
     print(key+"="+str(value))
"""Выводим с помощью цикла страну и её столицу"""
